{
    "AllianceGenome": "A keyword representing resources from the Alliance of Genome Resources, a unified portal for model organism genetics.",
    "AnimalQTLdb": "A database compiling Quantitative Trait Loci (QTL) information for various animal species.",
    "FLYBASE": "A comprehensive database for Drosophila (fruit fly) genetics and molecular biology.",
    "HGNC": "A keyword representing the HUGO Gene Nomenclature Committee, responsible for the approval of unique symbols and names for human genes.",
    "HPRD": "A keyword representing the Human Protein Reference Database, which includes information on human proteins and their interactions.",
    "MGI": "A keyword representing the Mouse Genome Informatics resource, which provides comprehensive data on laboratory mouse genetics and biology.",
    "MIM": "A keyword representing the Mendelian Inheritance in Man database, a catalog of human genes and genetic disorders.",
    "RATMAP": "A keyword related to mapping data for rat genomes.",
    "RGD": "A keyword representing the Rat Genome Database, a curated collection of genetic and genomic data for the laboratory rat.",
    "SGD": "A keyword representing the Saccharomyces Genome Database, a resource for the yeast Saccharomyces cerevisiae genetics and molecular biology.",
    "TAIR": "Keywords related to the Arabidopsis Information Resource, specializing in Arabidopsis thaliana genetics and molecular biology.",
    "Vega": "Text fields involving the Vertebrate Genome Annotation database, focusing on high-quality genome annotations.",
    "WormBase": "Keywords associated with the WormBase database, which is a comprehensive resource for Caenorhabditis elegans biology.",
    "Xenbase": "Keywords linked to Xenbase, the Xenopus laevis and Xenopus tropicalis biology and genomics resource.",
    "ZFIN": "Keywords pertaining to the Zebrafish Information Network for zebrafish research and genomics.",
    "accession.genomic": "Text fields providing accession numbers for genomic sequences.",
    "accession.protein": "Text fields providing accession numbers for protein sequences.",
    "accession.rna": "Text fields providing accession numbers for RNA sequences.",
    "alias": "Keywords for alternative names or aliases for genes or proteins.",
    "biocarta": "Text fields connected to BioCarta pathways, which represent molecular pathways based on curated databases.",
    "clingen.clinical_validity.classification": "A keyword indicating the level of clinical validity for a gene-disease pair.",
    "clingen.clinical_validity.classification_date": "The date when the clinical validity classification was assigned.",
    "clingen.clinical_validity.disease_label": "A textual label describing the disease associated with the gene-disease clinical validity.",
    "clingen.clinical_validity.gcep": "Text indicating the Gene Curation Expert Panel responsible for the validity analysis.",
    "clingen.clinical_validity.moi": "A keyword indicating the mode of inheritance for the gene-disease association.",
    "clingen.clinical_validity.mondo": "A keyword corresponding to the MONDO disease ontology term for the disease.",
    "clingen.clinical_validity.online_report": "A text field that holds a link or reference to the online report detailing clinical validity.",
    "clingen.clinical_validity.sop": "A keyword indicating the Standard Operating Procedure used for the clinical validity assessment.",
    "ec": "A keyword representing the Enzyme Commission number for an enzyme classification.",
    "ensembl.gene": "A keyword referring to the Ensembl gene identifier.",
    "ensembl.protein": "An identifier for protein sequences in the Ensembl database.",
    "ensembl.transcript": "An identifier for transcript sequences in the Ensembl database.",
    "ensembl.type_of_gene": "The category or classification of the gene in the Ensembl database.",
    "entrezgene": "A unique identifier for a gene provided by the NCBI Entrez Gene database.",
    "exac.bp": "The total number of base pairs from the Exome Aggregation Consortium (ExAC) data.",
    "exac.cds_end": "The end position of the coding sequence (CDS) in base pairs according to ExAC data.",
    "exac.cds_start": "The start position of the coding sequence (CDS) in base pairs according to ExAC data.",
    "exac.n_exons": "The number of exons in a gene according to ExAC data.",
    "exac.transcript": "A textual reference to the transcript according to ExAC data.",
    "generif.pubmed": "A reference to PubMed identifiers associated with gene functions in GeneRIF.",
    "generif.text": "Contains textual information related to gene functions, interactions, or traits derived from research findings.",
    "genomic_pos.chr": "Keyword datatype representing the chromosome where the gene is located in the reference genome.",
    "genomic_pos.end": "Long integer indicating the ending position of the gene on the chromosome.",
    "genomic_pos.start": "Long integer indicating the starting position of the gene on the chromosome.",
    "genomic_pos.strand": "Byte representing the DNA strand (forward or reverse) where the gene is situated.",
    "genomic_pos_hg19.chr": "Keyword datatype representing the chromosome location in the human genome version hg19.",
    "genomic_pos_hg19.end": "Long integer indicating the ending position of the gene on the chromosome in human genome version hg19.",
    "genomic_pos_hg19.start": "Long integer indicating the starting position of the gene on the chromosome in human genome version hg19.",
    "genomic_pos_hg19.strand": "Byte representing the DNA strand (forward or reverse) in the human genome version hg19.",
    "genomic_pos_mm9.chr": "Keyword datatype representing the chromosome location in the mouse genome version mm9.",
    "genomic_pos_mm9.end": "Represents the end position of a gene on the mouse mm9 genomic assembly (data type: long).",
    "genomic_pos_mm9.start": "Indicates the start position of a gene on the mouse mm9 genomic assembly (data type: long).",
    "genomic_pos_mm9.strand": "Denotes the strand orientation of a gene on the mouse mm9 genomic assembly (data type: byte).",
    "go.BP.category": "Specifies the category of a Gene Ontology Biological Process (data type: text).",
    "go.BP.evidence": "Provides the type of evidence supporting the association of a gene with a Biological Process (data type: text).",
    "go.BP.id": "Identifies the Gene Ontology Biological Process with a unique keyword (data type: keyword).",
    "go.BP.pubmed": "References the PubMed ID associated with the Biological Process evidence (data type: long).",
    "go.BP.term": "Describes the specific Gene Ontology Biological Process term (data type: text).",
    "go.CC.category": "Indicates the category of a Gene Ontology Cellular Component (data type: text).",
    "go.CC.evidence": "Specifies the type of evidence supporting the association of a gene with a Cellular Component (data type: text).",
    "go.CC.id": "Gene Ontology ID for Cellular Component",
    "go.CC.pubmed": "PubMed ID associated with Cellular Component term",
    "go.CC.term": "Description of the Cellular Component term",
    "go.MF.category": "Category of the Molecular Function",
    "go.MF.evidence": "Evidence code for Molecular Function",
    "go.MF.id": "Gene Ontology ID for Molecular Function",
    "go.MF.pubmed": "PubMed ID associated with Molecular Function term",
    "go.MF.term": "Description of the Molecular Function term",
    "homologene.genes": "List of genes in the HomoloGene group",
    "homologene.id": "ID of the HomoloGene group",
    "humancyc": "Contains detailed information on human metabolic pathways and enzymes.",
    "interpro.desc": "Provides descriptions of protein families, domains, and functional sites.",
    "interpro.id": "Represents unique identifiers for InterPro entries.",
    "interpro.short_desc": "Offers concise descriptions of InterPro entries.",
    "ipi": "Represents International Protein Index identifiers, used for protein identification.",
    "kegg": "Contains information pertaining to KEGG pathways, genes, and related biochemical entities.",
    "locus_tag": "Unique identifiers assigned to genomic loci.",
    "map_location": "Specifies the genetic or physical location of a gene on the chromosome.",
    "miRBase": "Database identifiers for microRNA sequences and associated information.",
    "mousecyc": "Contains detailed information on mouse metabolic pathways and enzymes.",
    "name": "General descriptive field containing the main name or title.",
    "netpath": "A text field likely detailing pathway-related information within a network.",
    "other_names": "A text field capturing alternative names or synonyms.",
    "pantherdb.Araport": "A keyword referencing the Arabidopsis genome database in the PANTHER classification system.",
    "pantherdb.EcoGene": "A keyword corresponding to the E. coli gene database in the PANTHER classification system.",
    "pantherdb.Ensembl": "A keyword linking to the Ensembl gene database within the PANTHER classification system.",
    "pantherdb.EnsemblGenome": "A keyword referring to the Ensembl Genomes database in the PANTHER classification system.",
    "pantherdb.FlyBase": "A keyword associated with the Drosophila database in the PANTHER classification system.",
    "pantherdb.Gene": "A keyword summarizing broader gene-related queries within the PANTHER classification system.",
    "pantherdb.GeneID": "A keyword identifying specific gene IDs within the PANTHER classification system.",
    "pantherdb.Gene_Name": "Type: keyword; Represents the standardized name of a gene.",
    "pantherdb.Gene_ORFName": "Type: keyword; Represents the name of a gene's open reading frame.",
    "pantherdb.Gene_OrderedLocusName": "Type: keyword; Refers to the systematic and ordered name given to a gene at a specific locus.",
    "pantherdb.HGNC": "Type: keyword; Stands for HUGO Gene Nomenclature Committee, which standardizes human gene names.",
    "pantherdb.MGI": "Type: keyword; Refers to the Mouse Genome Informatics database.",
    "pantherdb.PomBase": "Type: keyword; Refers to the database for Schizosaccharomyces pombe (fission yeast) genomics.",
    "pantherdb.RGD": "Type: keyword; Stands for Rat Genome Database.",
    "pantherdb.SGD": "Type: keyword; Refers to the Saccharomyces Genome Database for budding yeast.",
    "pantherdb.TAIR": "Type: keyword; Refers to The Arabidopsis Information Resource.",
    "pantherdb.WormBase": "Type: keyword; Refers to the database focused on the genetics and genomics of Caenorhabditis elegans.",
    "pantherdb.ZFIN": "ZFIN is a resource for the zebrafish research community providing information on gene function and development.",
    "pantherdb.dictyBase": "dictyBase is a database for the model organism Dictyostelium discoideum, offering genetic and functional data.",
    "pantherdb.ortholog.Araport": "Araport serves as a resource for Arabidopsis thaliana gene information and orthologs.",
    "pantherdb.ortholog.EcoGene": "EcoGene is a database for Escherichia coli gene information and functional genomics.",
    "pantherdb.ortholog.Ensembl": "Ensembl provides a comprehensive genome database for vertebrate and other model organism genomes.",
    "pantherdb.ortholog.EnsemblGenome": "EnsemblGenomes extends the Ensembl platform to non-vertebrate genomes.",
    "pantherdb.ortholog.FlyBase": "FlyBase is a database of Drosophila genetics and molecular biology.",
    "pantherdb.ortholog.Gene": "This field references general orthologous gene information across different species.",
    "pantherdb.ortholog.GeneCards": "GeneCards is a database that provides comprehensive information on human genes.",
    "pantherdb.ortholog.GeneID": "GeneID refers to a unique identifier for genes in the NCBI database.",
    "pantherdb.ortholog.Gene_Name": "A keyword field storing the common name of the gene.",
    "pantherdb.ortholog.Gene_ORFName": "A keyword field capturing the Open Reading Frame (ORF) name of a gene.",
    "pantherdb.ortholog.Gene_OrderedLocusName": "A keyword field indicating the ordered locus name of the gene.",
    "pantherdb.ortholog.HGNC": "A keyword field representing the HGNC (HUGO Gene Nomenclature Committee) gene symbol.",
    "pantherdb.ortholog.MGI": "A keyword field containing the MGI (Mouse Genome Informatics) gene identifier.",
    "pantherdb.ortholog.PomBase": "A keyword field for the gene identifier from PomBase, the repository for Schizosaccharomyces pombe.",
    "pantherdb.ortholog.RGD": "A keyword field indicating the RGD (Rat Genome Database) gene identifier.",
    "pantherdb.ortholog.SGD": "A keyword field representing the SGD (Saccharomyces Genome Database) gene identifier.",
    "pantherdb.ortholog.TAIR": "A keyword field capturing the identifier from TAIR (The Arabidopsis Information Resource).",
    "pantherdb.ortholog.WormBase": "A keyword field containing the gene identifier from WormBase, the database for Caenorhabditis elegans.",
    "pantherdb.ortholog.ZFIN": "ZFIN identifier for orthologs in the PANTHER database.",
    "pantherdb.ortholog.dictyBase": "DictyBase identifier for orthologs in the PANTHER database.",
    "pantherdb.ortholog.ortholog_type": "Type of ortholog relationship in the PANTHER database.",
    "pantherdb.ortholog.panther_family": "PANTHER family identifier associated with orthologs.",
    "pantherdb.ortholog.taxid": "NCBI Taxonomy Identifier for species in the PANTHER database.",
    "pantherdb.ortholog.uniprot_kb": "UniProtKB identifier for orthologs in the PANTHER database.",
    "pantherdb.uniprot_kb": "UniProtKB identifier used in the PANTHER database.",
    "pathway.biocarta.id": "BioCarta pathway identifier.",
    "pathway.biocarta.name": "Name of the BioCarta pathway.",
    "pathway.humancyc.id": "HumanCyc pathway identifier.",
    "pathway.humancyc.name": "Text field representing the name of a pathway in the HumanCyc database.",
    "pathway.kegg.id": "Text field representing the identifier of a pathway in the KEGG database.",
    "pathway.kegg.name": "Text field representing the name of a pathway in the KEGG database.",
    "pathway.mousecyc.id": "Text field representing the identifier of a pathway in the MouseCyc database.",
    "pathway.mousecyc.name": "Text field representing the name of a pathway in the MouseCyc database.",
    "pathway.netpath.id": "Text field representing the identifier of a pathway in the NetPath database.",
    "pathway.netpath.name": "Text field representing the name of a pathway in the NetPath database.",
    "pathway.pharmgkb.id": "Text field representing the identifier of a pathway in the PharmGKB database.",
    "pathway.pharmgkb.name": "Text field representing the name of a pathway in the PharmGKB database.",
    "pathway.pid.id": "Text field representing the identifier of a pathway in the PID (Pathway Interaction Database).",
    "pathway.pid.name": "Name of a pathway in the PID (Pathway Interaction Database).",
    "pathway.reactome.id": "Identifier for a pathway in the Reactome database.",
    "pathway.reactome.name": "Name of a pathway in the Reactome database.",
    "pathway.smpdb.id": "Identifier for a pathway in the SMPDB (Small Molecule Pathway Database).",
    "pathway.smpdb.name": "Name of a pathway in the SMPDB.",
    "pathway.wikipathways.id": "Identifier for a pathway in the WikiPathways database.",
    "pathway.wikipathways.name": "Name of a pathway in the WikiPathways database.",
    "pathway.yeastcyc.id": "Identifier for a pathway in the YeastCyc database.",
    "pathway.yeastcyc.name": "Name of a pathway in the YeastCyc database.",
    "pdb": "Identifier for a protein structure in the Protein Data Bank (PDB).",
    "pfam": "A database of protein families, domains, and functional sites.",
    "pharmgkb": "A resource that curates information about the impact of human genetic variation on drug responses.",
    "pharos.target_id": "An integer identifier for targets within the Pharos drug discovery platform.",
    "pharos.tdl": "A keyword representing the target development level in the Pharos system.",
    "pid": "An identifier or unique text record for a specific dataset or entry.",
    "pir": "A resource providing protein sequence and functional annotation information.",
    "prosite": "A database of protein domains, families, and functional sites based on sequence alignment.",
    "reactome": "A curated database of pathways and reactions in human biology.",
    "reagent.CM-LibrX-no-seq.id": "A keyword identifier for reagents used within the CM-LibrX library.",
    "reagent.CM-LibrX-no-seq.relationship": "Text describing the relationship or usage context of reagents within the CM-LibrX library.",
    "reagent.CondMedia_CM_LibrAB.id": "Identifier for the conditioned media library AB.",
    "reagent.CondMedia_CM_LibrAB.relationship": "Describes the relationship or context of the conditioned media library AB.",
    "reagent.GNF_Qia_hs-genome_v1_siRNA.id": "Identifier for the GNF-Qia human genome version 1 siRNA.",
    "reagent.GNF_Qia_hs-genome_v1_siRNA.relationship": "Describes the relationship or context of the GNF-Qia human genome version 1 siRNA.",
    "reagent.GNF_hs-GPCR_IDT-siRNA.id": "Identifier for the GNF human GPCR IDT siRNA.",
    "reagent.GNF_hs-GPCR_IDT-siRNA.relationship": "Describes the relationship or context of the GNF human GPCR IDT siRNA.",
    "reagent.GNF_hs-ORFeome1_1_reads.id": "Identifier for the GNF human ORFeome 1.1 reads.",
    "reagent.GNF_hs-ORFeome1_1_reads.relationship": "Describes the relationship or context of the GNF human ORFeome 1.1 reads.",
    "reagent.GNF_hs-Origene.id": "Identifier for the GNF human Origene.",
    "reagent.GNF_hs-Origene.relationship": "Describes the relationship or context of the GNF human Origene.",
    "reagent.GNF_hs-druggable_lenti-shRNA.id": "Identifier for druggable human lentiviral shRNA reagents.",
    "reagent.GNF_hs-druggable_lenti-shRNA.relationship": "Description of relationships for druggable human lentiviral shRNA reagents.",
    "reagent.GNF_hs-druggable_plasmid-shRNA.id": "Identifier for druggable human plasmid shRNA reagents.",
    "reagent.GNF_hs-druggable_plasmid-shRNA.relationship": "Description of relationships for druggable human plasmid shRNA reagents.",
    "reagent.GNF_hs-druggable_siRNA.id": "Identifier for druggable human siRNA reagents.",
    "reagent.GNF_hs-druggable_siRNA.relationship": "Description of relationships for druggable human siRNA reagents.",
    "reagent.GNF_hs-oncomine_IDT-siRNA.id": "Identifier for Oncomine human siRNA reagents from IDT.",
    "reagent.GNF_hs-oncomine_IDT-siRNA.relationship": "Description of relationships for Oncomine human siRNA reagents from IDT.",
    "reagent.GNF_hs-pkinase_IDT-siRNA.id": "Identifier for pkinase human siRNA reagents from IDT.",
    "reagent.GNF_hs-pkinase_IDT-siRNA.relationship": "Description of relationships for pkinase human siRNA reagents from IDT.",
    "reagent.GNF_hs_LentiORF-HA-MYC.id": "A unique identifier for the LentiORF-HA-MYC reagent.",
    "reagent.GNF_hs_LentiORF-HA-MYC.relationship": "Describes the connection or usage context of the LentiORF-HA-MYC reagent.",
    "reagent.GNF_hs_LentiORF-Jred.id": "A unique identifier for the LentiORF-Jred reagent.",
    "reagent.GNF_hs_LentiORF-Jred.relationship": "Describes the connection or usage context of the LentiORF-Jred reagent.",
    "reagent.GNF_mm+hs-MGC.id": "A unique identifier for the combined mouse and human MGC reagent.",
    "reagent.GNF_mm+hs-MGC.relationship": "Describes the connection or usage context of the combined mouse and human MGC reagent.",
    "reagent.GNF_mm+hs_RetroCDNA.id": "A unique identifier for the combined mouse and human RetroCDNA reagent.",
    "reagent.GNF_mm+hs_RetroCDNA.relationship": "Describes the connection or usage context of the combined mouse and human RetroCDNA reagent.",
    "reagent.GNF_mm-GIPZ_shRNA.id": "A unique identifier for the GIPZ mouse shRNA reagent.",
    "reagent.GNF_mm-GIPZ_shRNA.relationship": "Describes the connection or usage context of the GIPZ mouse shRNA reagent.",
    "reagent.GNF_mm-TLR_lenti_shRNA.id": "A keyword identifier for a lentiviral shRNA reagent targeting mouse TLR genes.",
    "reagent.GNF_mm-TLR_lenti_shRNA.relationship": "Textual relationship information for the lentiviral shRNA targeting mouse TLR genes.",
    "reagent.GNF_mm-kinase_lenti-shRNA.id": "A keyword identifier for a lentiviral shRNA reagent targeting mouse kinase genes.",
    "reagent.GNF_mm-kinase_lenti-shRNA.relationship": "Textual relationship information for the lentiviral shRNA targeting mouse kinase genes.",
    "reagent.GNF_mm-kinase_plasmid-shRNA.id": "A keyword identifier for a plasmid-based shRNA reagent targeting mouse kinase genes.",
    "reagent.GNF_mm-kinase_plasmid-shRNA.relationship": "Textual relationship information for the plasmid-based shRNA targeting mouse kinase genes.",
    "reagent.IDT_27mer_hs_ATPase_siRNAs.id": "A keyword identifier for siRNA reagents targeting human ATPase genes, provided by IDT.",
    "reagent.IDT_27mer_hs_ATPase_siRNAs.relationship": "Textual relationship information for the siRNA reagents targeting human ATPase genes.",
    "reagent.Invitrogen_IVTHSSIPKv2.id": "A keyword identifier for an Invitrogen reagent.",
    "reagent.Invitrogen_IVTHSSIPKv2.relationship": "Textual relationship information for this Invitrogen reagent.",
    "reagent.MasterSecretomicsList": "Contains identifiers and relationships for the Master Secretomics list reagents.",
    "reagent.NIBRI_hs-Secretome_pDEST": "Comprises identifiers and relationships related to NIBRI human secretome pDEST reagents.",
    "reagent.NOVART_hs-genome_siRNA": "Includes identifiers and relationships for NOVART human genome siRNA reagents.",
    "reagent.Qiagen_mouse_QMIHSINHIBv1": "Contains identifiers and relationships for Qiagen mouse QMIHSINHIBv1 reagents.",
    "reagent.Qiagen_mouse_QMIHSMIMv1": "Comprises identifiers and relationships related to Qiagen mouse QMIHSMIMv1 reagents.",
    "refseq.genomic": "Genomic sequences from the RefSeq database including complete genomes from various organisms.",
    "refseq.protein": "Protein sequences from the RefSeq database including annotated protein-coding genes.",
    "refseq.rna": "RNA sequences from the RefSeq database covering various RNA types such as mRNA and non-coding RNA.",
    "reporter.AraGene-1_0": "Reporter gene data specific to Arabidopsis species from array-based analysis.",
    "reporter.BovGene-1_0": "Reporter gene data specific to bovine species from array-based analysis.",
    "reporter.CanGene-1_0": "Reporter gene data specific to canine species from array-based analysis.",
    "reporter.ChiGene-1_0": "Reporter gene data specific to chicken species from array-based analysis.",
    "reporter.CyRGene-1_0": "Reporter gene data specific to Cynomolgus monkeys from array-based analysis.",
    "reporter.CynGene-1_0": "Reporter gene data specific to Cynomolgus monkeys from array-based analysis.",
    "reporter.DroGene-1_0": "Reporter gene data specific to Drosophila species from array-based analysis.",
    "reporter.EleGene-1_0": "Keyword identifier used in the Elephant gene expression dataset.",
    "reporter.EquGene-1_0": "Keyword identifier used in the Horse gene expression dataset.",
    "reporter.FelGene-1_0": "Keyword identifier used in the Cat gene expression dataset.",
    "reporter.GNF1H": "Keyword identifier used in the GNF Homo sapiens (human) gene expression dataset.",
    "reporter.GNF1M": "Keyword identifier used in the GNF Mus musculus (mouse) gene expression dataset.",
    "reporter.GuiGene-1_0": "Keyword identifier used in the Guinea pig gene expression dataset.",
    "reporter.HG-U133_Plus_2": "Keyword identifier used in the Human genome U133 Plus 2.0 array dataset.",
    "reporter.HG-U95Av2": "Keyword identifier used in the Human genome U95Av2 array dataset.",
    "reporter.HG-U95B": "Keyword identifier used in the Human genome U95B array dataset.",
    "reporter.HTA-2_0": "Keyword identifier used in the Human Transcriptome Array 2.0 dataset.",
    "reporter.HuEx-1_0": "Affymetrix Human Exon 1.0 ST Array",
    "reporter.HuGene-1_1": "Affymetrix Human Gene 1.1 ST Array",
    "reporter.HuGene-2_1": "Affymetrix Human Gene 2.1 ST Array",
    "reporter.MG-U74Av2": "Affymetrix Murine Genome U74 Version 2 Array Set A",
    "reporter.MG-U74Bv2": "Affymetrix Murine Genome U74 Version 2 Array Set B",
    "reporter.MTA-1_0": "Affymetrix Mouse Transcriptome Array 1.0",
    "reporter.MarGene-1_0": "Affymetrix Marine Gene 1.0 ST Array",
    "reporter.MoEx-1_0": "Affymetrix Mouse Exon 1.0 ST Array",
    "reporter.MoGene-1_1": "Affymetrix Mouse Gene 1.1 ST Array",
    "reporter.MoGene-2_1": "Affymetrix Mouse Gene 2.1 ST Array",
    "reporter.Mouse430_2": "A keyword indicating a probe set from the Mouse430_2 microarray platform used for mouse gene expression studies.",
    "reporter.PorGene-1_0": "A keyword denoting a probe set from the PorGene-1_0 microarray platform for porcine gene expression analysis.",
    "reporter.RCnGene-1_0": "A keyword representing a probe set from the RCnGene-1_0 microarray platform used for canine gene expression research.",
    "reporter.RG-U34A": "A keyword referring to a probe set from the RG-U34A microarray platform often used in rat gene expression profiling.",
    "reporter.RG-U34B": "A keyword indicating a probe set from the RG-U34B microarray platform used for rat gene expression analysis alongside RG-U34A.",
    "reporter.RJpGene-1_0": "A keyword denoting a probe set from the RJpGene-1_0 microarray platform for Japanese pufferfish gene expression studies.",
    "reporter.RUSGene-1_0": "A keyword representing a probe set from the RUSGene-1_0 microarray platform used for gene expression analysis in the Russian sturgeon.",
    "reporter.RaEx-1_0": "A keyword referring to a probe set from the RaEx-1_0 microarray platform for rat gene expression analysis.",
    "reporter.RaGene-1_1": "A keyword indicating a probe set from the RaGene-1_1 microarray platform for rat gene expression profiling.",
    "reporter.RaGene-2_1": "A keyword representing a probe set from the RaGene-2_1 microarray platform used in advanced rat gene expression studies.",
    "reporter.RabGene-1_0": "Specifies a keyword related to the RabGene-1.0 reporter.",
    "reporter.Rat230_2": "Specifies a keyword related to the Rat230_2 reporter.",
    "reporter.RheGene-1_0": "Specifies a keyword related to the RheGene-1.0 reporter.",
    "reporter.SoyGene-1_0": "Specifies a keyword related to the SoyGene-1.0 reporter.",
    "reporter.ZebGene-1_0": "Specifies a keyword related to the ZebGene-1.0 reporter.",
    "reporter.snowball": "Specifies a keyword related to the snowball reporter.",
    "retired": "Indicates the retirement status, represented as a long integer.",
    "smpdb": "Contains text related to the SMPDB database.",
    "summary": "Contains a textual summary of the relevant information.",
    "symbol": "Specifies a keyword related to the symbol.",
    "taxid": "This field stores the taxonomy identifier of an organism, represented as an integer.",
    "type_of_gene": "This field categorizes the gene based on its type using a keyword.",
    "umls.cui": "This field contains the Unified Medical Language System Concept Unique Identifier for a gene using a keyword.",
    "umls.protein_cui": "This field includes the UMLS Concept Unique Identifier specific to proteins, represented as a keyword.",
    "unigene": "This field holds the UniGene cluster identifier using a keyword format.",
    "uniprot.Swiss-Prot": "This field references the UniProt Swiss-Prot accession number using a keyword.",
    "uniprot.TrEMBL": "This field includes the UniProt TrEMBL accession number using a keyword.",
    "wikipathways": "This field captures pathway information from WikiPathways using text data.",
    "wikipedia.url_stub": "This field stores the URL stub for the Wikipedia page associated with the gene/product using text.",
    "yeastcyc": "This field includes information from yeast-specific pathway databases like YeastCyc using text."
}